<?php


/*
 * В части 10 на 16й минуте показано как передавать объект в другой объект - через метод.
 * с 18й минуты - передача в класс данных учитывая тип этих даных
 * 
 * ЧАСТЬ 13 ДО 7й минуты - проблемы которые должно решать наследование - проблемы разных типов данных
 *             после - реализация наследования
 * 
 * $ad1 = new Ad( ...parameters... ) - создание объекта
 * Объекты в 11 задании:
 * - писатель - кто создаёт, редактирует объявления
 * - расклейщик объявлений - тот кто делает список объявлений
 * - администратор - кто принимает заявки от клиентов, работает с базой данных
 * 
 * Объекты в 11 задании
 * - Хранилище объявлений
 * - Доска объявлений
 * - Объявление
 * 
 * Что можно делать в этом задании???
 * 1. Создавать классы состоящие из
 *      - свойств
 *      - методов
 * 2.1. Выводить на экран значения свойств.
 * 2.2. Выводить на экран то что возвращают методы.
 * 
 * 3. Следовательно если что-то можно вывсти на экран значит это же можно и передать в епременную или метод или другому объекту
 * 4. Можно вызывать метод с передачей ему аргументов или без передачи аргументов и делать это вне методов ( а сдедовательно вне классов )
 * 4. Можно вызывать метод из другого метода
 * 5. Оператор instanceof используется для определения того, является ли текущий объект экземпляром указанного класса. 
 * 
 *      
 * 
 * 
 * 
 */




?>